app/controllers/items_controller.rb

SELECT * FROM `categories`
SELECT `items`.* FROM `items` WHERE (`items`.category_id IN (1,2,3,4))
---
  def index
    @categories = Category.all :include => :items

SELECT * FROM `items` WHERE (`items`.`id` = 4)
UPDATE `items` SET `updated_at` = '2009-12-03 12:24:53', `checked` = 1 WHERE `id` = 4
---
  def update
    @item = Item.find params[:id]
    @item.update_attributes params[:item]

SELECT * FROM `items`
UPDATE `items` SET `updated_at` = '2009-12-05 00:26:17', `checked` = 1 WHERE `id` = 3
---
  def select
    Item.all.each{ |item| item.update_attribute :checked, true }

SELECT * FROM `items`
UPDATE `items` SET `updated_at` = '2009-12-05 00:26:20', `checked` = 0 WHERE `id` = 1
---
  def deselect
    Item.all.each{ |item| item.update_attribute :checked, false }